#-*- coding: utf-8 -*-
_rules= [
	["머", "대"],
	["대", "머"],
	["며", "띠"],
	["명", "띵"],
	["멍", "댕"],
	["디", "ㅁ"],
	["광", "팡"],
	["진", "건"],
	["피", "끠"],
	["귀", "커"],
	["커", "귀"],
	["유", "윾"],
	["비", "네"],
	["빅", "넥"],
	["네", "비"],
	["넥", "빅"],
	["우", "윽"],
	["왕", "앟"],
	["근", "ㄹ"],
	["비버", "뜨또"],
	["비냉", "ㅇ도뜨"],
	["오우야", "퍄"],
	["또", "SE"],
	["복복", "뾲"],
	["조조", "쬬"],
	["돌돔", "똚"],
	["존좋", "쬲"],
	["부부", "쀼"],
	["장", "튽"],
	#["号哭", "믁뽓"],
	["시", "N"],
	["드", "⊆"],
	["김", "숲"],
	["식", "싀"],
	["믹", "믜"],
	["귀", "커"],
]
str = raw_input("input string\n").decode('euc-kr')

for rule in _rules:
	str = str.replace(rule[0].decode('utf-8'), rule[1].decode('utf-8'))

print str
raw_input("")

